_articles/2013-10-16-Linux-Command.org
#+TITLE:Linux Command
#+AUTHOR:ICECREAM(氷菓)
#+EMAIL:creamidea(AT)gmail.com
#+DESCRIPTION:ICECREAM(氷菓)
#+KEYWORDS:linux command
#+OPTIONS:H:4 num:t toc:t \n:nil @:t ::t |:t ^:t f:t TeX:t email:t
#+LINK_HOME: https://creamidea.github.io
#+STYLE:<link rel="stylesheet" type="text/css" href="../css/style.css">
#+INFOJS_OPT: view: showall toc: nil

#+BEGIN_HTML
---
layout: doc
title: Linux Command
subtitle: 收集整理Linux常用命令 
categories: note
tags: linux command
---
#+END_HTML

* 前言
每次都是Google完了，就算了。当时是记住了，但是今后呢？

于是就有了这篇文章

* 用户篇

** 增加用户：
   #+BEGIN_SRC sh
     # -s指定shell
     # -g指定组名
     # -G指定加入组（附加组）
     useradd -s /bin/sh -g group –G adm,root gem
   #+END_SRC
   
   *Reference:*
   - http://blog.sina.com.cn/s/blog_47051c800100oegn.html

** 批量增加用户:
   #+BEGIN_SRC sh
     #!/bin/bash/
     # 创建用户
     for i in `cat user.list`
     do
         useradd -d /home/$i -m $i
         useradd -g wsng $i
         echo "password" | passwd --stdin $i
     done
   #+END_SRC

   #+BEGIN_EXAMPLE
     someone1
     someone2
     someone3
   #+END_EXAMPLE
   
   *Reference:*
   - http://blog.chinaunix.net/uid-26301963-id-3055415.html

** 增加用户到组:
   1. 增加一个新用户到主要用户组：
      #+BEGIN_SRC sh
        # 增加用户icecream到wsng
        # -g将新增加的用户初始化为指定登录组，此名必须存在
        useradd -g wsng icecream
      #+END_SRC
   2. 增加一个已有用户到一个已有用户组中
      #+BEGIN_SRC sh
        # 用户icecream不必离开原组
        usermod -a -G wsng icecream
        # 将用户组改为wsng
        usermod -g wsng icecream
      #+END_SRC
