_posts/2013-10-16-Linux-Command.html
---
layout: doc
title: Linux Command
subtitle: 收集整理Linux常用命令 
categories: note
tags: linux command
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 前言</a></li>
<li><a href="#sec-2">2 用户篇</a>
<ul>
<li><a href="#sec-2-1">2.1 增加用户：</a></li>
<li><a href="#sec-2-2">2.2 批量增加用户:</a></li>
<li><a href="#sec-2-3">2.3 增加用户到组:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">前言</h2>
<div class="outline-text-2" id="text-1">

<p>每次都是Google完了，就算了。当时是记住了，但是今后呢？
</p>
<p>
于是就有了这篇文章
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">用户篇</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">增加用户：</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="example"># -s指定shell
# -g指定组名
# -G指定加入组（附加组）
useradd -s /bin/sh -g group –G adm,root gem
</pre>


<p>   
   <b>Reference:</b>
</p><ul>
<li><a href="http://blog.sina.com.cn/s/blog_47051c800100oegn.html">http://blog.sina.com.cn/s/blog_47051c800100oegn.html</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">批量增加用户:</h3>
<div class="outline-text-3" id="text-2-2">




<pre class="example">#!/bin/bash/
# 创建用户
for i in `cat user.list`
do
    useradd -d /home/$i -m $i
    useradd -g wsng $i
    echo "password" | passwd --stdin $i
done
</pre>



<pre class="example">someone1
someone2
someone3
</pre>


<p>   
   <b>Reference:</b>
</p><ul>
<li><a href="http://blog.chinaunix.net/uid-26301963-id-3055415.html">http://blog.chinaunix.net/uid-26301963-id-3055415.html</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">增加用户到组:</h3>
<div class="outline-text-3" id="text-2-3">

<ol>
<li>增加一个新用户到主要用户组：



<pre class="example"># 增加用户icecream到wsng
# -g将新增加的用户初始化为指定登录组，此名必须存在
useradd -g wsng icecream
</pre>

</li>
<li>增加一个已有用户到一个已有用户组中



<pre class="example"># 用户icecream不必离开原组
usermod -a -G wsng icecream
# 将用户组改为wsng
usermod -g wsng icecream
</pre>

</li>
</ol>

</div>
</div>
</div>
